
# 1.Определить форму связи между факторными и результативными признаками,
# построив корреляционные поля на плоскости для каждой пары факторов.
# Записать уравнение множественной регрессии.

# 2. Произвести отбор факторов, включаемых в модель.

# 3. Определить тесноту связи между факторами, включенными в модель множественной линейной корреляции.

# 4. Найти оценки уравнения регрессии по методу наименьших квадратов.

# 5. Проверить адекватность полученного модельного уравнения регрессии тремя
# способами:
# – с помощью коэффициента детерминации R2; – по критерию Фишера;
# – с помощью средней ошибки аппроксимации.

# 6. Определить воздействие неучтенных в модели факторов.

# 7. Дать экономическую интерпретацию найденных оценок уравнения регрессии.